{"type":"data","nodes":[{"type":"data","data":[{"footer":1},{"html":2,"slug":3,"uuid":4,"created":5,"date":6,"published":7,"abstract":8,"tags":9,"links":-1,"type":10,"cover_image":-1,"description":11,"folder":12},"\u003Cp>Built with SvelteKit and hosted on GitHub Pages.\u003C/p>\n\u003Cp>View this website on \u003Ca href=\"https://github.com/Tiim/Tiim.github.io\" rel=\"nofollow noopener noreferrer\">GitHub\u003C/a>!\u003C/p>\n\u003Ch2>Other pages\u003C/h2>\n\u003Cul>\n\u003Cli>\u003Ca href=\"https://tiim.ch/pages/links\" rel=\"nofollow noopener noreferrer\">Links and Blogroll\u003C/a>\u003C/li>\n\u003C/ul>","footer","e556fd14-3acd-4a7b-9b31-929fdd6d2b7a",["Date","2023-07-31T20:16:19.000Z"],["Date","2023-07-31T20:16:19.000Z"],true,"\u003Cp>Built with SvelteKit and hosted on GitHub Pages.\u003C/p>",[],"article","","metadata"],"uses":{}},{"type":"data","data":[{"posts":1,"details":27},[2],{"html":3,"slug":4,"uuid":5,"date":6,"aliases":7,"title":9,"published":10,"modified":8,"description":11,"cover_image":12,"cover_caption":13,"content_tags":14,"abstract":19,"tags":20,"links":-1,"type":25,"folder":26},"\u003Cblockquote class=\"callout callout-warning\">\n\u003Cspan class=\"callout-title\">\u003Cspan class=\"callout-icon\">\u003Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 512 512\">\u003Cpath d=\"M256 32c14.2 0 27.3 7.5 34.5 19.8l216 368c7.3 12.4 7.3 27.7.2 40.1S486.3 480 472 480H40c-14.3 0-27.6-7.7-34.7-20.1s-7-27.8.2-40.1l216-368C228.7 39.5 241.8 32 256 32m0 128c-13.3 0-24 10.7-24 24v112c0 13.3 10.7 24 24 24s24-10.7 24-24V184c0-13.3-10.7-24-24-24m32 224c0-17.7-14.3-32-32-32s-32 14.3-32 32 14.3 32 32 32 32-14.3 32-32\">\u003C/path>\u003C/svg>\u003C/span>Update May 2024\u003C/span>\u003Cp>Storj has quietly removed their free plan and seems to hold all images on my website for ransom until I\npay for the premium plan. They have not notified my about this happening.\u003C/p>\n\u003Cp>If you pay for the premium version Storj might still work for you, but after this, I personnaly won't trust them with my data again!\u003C/p>\n\u003C/blockquote>\n\u003Cp>For a while now I have been looking for a way to put images on my website. At first I just embedded them in the website github repository, but this just doesn't feel right. Putting one or two image assets in a codebase is one thing, putting an ever growing list of images in there feels icky to me. For this reason I put the last few cover images of my blog posts on the imgur platform. This is slightly cleaner from a git standpoint but now i have to trust imgur to keep serving these images. Additionally, as I recently discovered, this seems to be against imgurs \u003Ca href=\"https://imgur.com/tos\" rel=\"nofollow noopener noreferrer\">TOS\u003C/a>:\u003C/p>\n\u003Cblockquote>\n\u003Cp>[...] Also, don't use Imgur to host image libraries you link to from elsewhere, content for your website, advertising, avatars, or anything else that turns us into your content delivery network.\u003C/p>\n\u003C/blockquote>\n\u003Cp>Finally when I started \u003Ca href=\"https://tiim.ch/blog/2022-12-indiewebifying-my-website-part-1\" rel=\"nofollow noopener noreferrer\">indie-webifying my website\u003C/a>, and was implementing the micropub protocol (which I will blog about at a later time), I decided that it was at the time to host the images on a platform that was meant to do that. I looked at a few storage providers such as cloudinary and S3 based object storage and landed on \u003Ca href=\"https://storj.io/\" rel=\"nofollow noopener noreferrer\">Storj.io\u003C/a>, mostly because of the generous free tier, which should suffice for this little blog for quite a while.\u003C/p>\n\u003Cp>One thing that bothered me slightly was that all storage providers I looked at charge for traffic. It's not the fact that it's an additional expense (if your not in the free tier anymore) that bothers me, but the fact that I don't have any control over how much this will cost me. In all likelihood this will never cost me anything since this blog has not much traffic, but if a post were to go viral (one can dream...), this could result in a surprise bill at the end of the month.\u003C/p>\n\u003Cp>To help with the traffic costs I decided to try to use the free CDN functionality of Cloudflare to reduce the traffic to Storj. In this blog post I will describe how I did that.\u003C/p>\n\u003Ch2>Is this the right solution for you?\u003C/h2>\n\u003Cp>If you are in a similar situation as me, and just want to have somewhere to host your images for a personal website or to share images or screenshots as links while still having control over all your data, this could be a good solution.\u003C/p>\n\u003Cp>If you want to build a robust image pipeline with resizing and image optimization, or you are building an enterprise website this is probably not the right way. You should take a look at cloudinary or one of the big cloud providers.\u003C/p>\n\u003Ch2>Prerequisites\u003C/h2>\n\u003Cp>To use Cloudflare as a CDN, you need to have Cloudflare setup as your DNS host for the domain you want to serve the images from. Even if you just want to use a subdomain like \u003Ccode>media.example.com\u003C/code>, the whole \u003Ccode>example.com\u003C/code> domain needs to be on cloudflare. For me this was not much of an issue, I followed the instructions from cloudflare and pointed the nameserver of my domain to cloudflare. Although I did have an issue during the migration, which resulted in my website being down for two hours. But I'm pretty sure this was caused by my previous nameserver provider.\u003C/p>\n\u003Ch2>Setting up Storj &#x26; Cloudflare\u003C/h2>\n\u003Cp>I assume you already have an account at \u003Ca href=\"https://storj.io/\" rel=\"nofollow noopener noreferrer\">storj.io\u003C/a>. The next step is creating a bucket for your images. A bucket is just a place for your files and folders to live in storj, just like in any other S3 compatible storage provider. (Actually there are no folders in storj and other S3 services, the folders are just prefixes of the filenames). When creating a bucket, make sure you save the passphrase securely, such as in your password manager. Whenever storj asks you for the passphrase, make sure you don't let storj generate a new one! Every new passphrase will create access to a new bucket.\u003C/p>\n\u003Cp>The next step is \u003Ca href=\"https://docs.storj.io/dcs/downloads/download-uplink-cli\" rel=\"nofollow noopener noreferrer\">installing the uplink cli\u003C/a>. Follow the quick start tutorial to \u003Ca href=\"https://docs.storj.io/dcs/getting-started/quickstart-uplink-cli/uploading-your-first-object\" rel=\"nofollow noopener noreferrer\">get an access grant\u003C/a>. Remember to use the same passphrase from above. Now follow the next quickstart tutorial to \u003Ca href=\"https://docs.storj.io/dcs/getting-started/quickstart-uplink-cli/uploading-your-first-object/set-up-uplink-cli\" rel=\"nofollow noopener noreferrer\">add the bucket to the uplink cli\u003C/a>. The file \u003Ccode>accessgrant.txt\u003C/code> in the tutorial only contains the access-grant string that you got from the last step.\u003C/p>\n\u003Cp>Finally we want to share the bucket so the images can be accessed from the web. For this you can run the following command:\u003C/p>\n\u003Cpre>\u003Ccode class=\"language-sh\">uplink share --dns &#x3C;domain> sj://&#x3C;bucket>/&#x3C;prefix> --not-after=none\n\u003C/code>\u003C/pre>\n\u003Cp>Replace \u003Ccode>&#x3C;domain>\u003C/code> with the domain you want to serve the images from. In my case I use \u003Ccode>media.tiim.ch\u003C/code>. Then replace \u003Ccode>&#x3C;bucket>\u003C/code> with the name of your bucket and \u003Ccode>&#x3C;prefix>\u003C/code> with the prefix.\u003C/p>\n\u003Cp>As mentioned above, you can think of a prefix as a folder. If you use for example \u003Ccode>media-site1\u003C/code> as a prefix, then every file in the \"folder\" \u003Ccode>media-site1\u003C/code> will be shared. This means you can use multiple prefixes to serve files for multiple websites in the same bucket.\u003C/p>\n\u003Cp>You will get the following output:\u003C/p>\n\u003Cpre>\u003Ccode>[...]\n=========== DNS INFO =====================================================================\nRemember to update the $ORIGIN with your domain name. You may also change the $TTL.\n$ORIGIN example.com.\n$TTL    3600\nmedia.example.com           IN      CNAME   link.storjshare.io.\ntxt-media.example.com       IN      TXT     storj-root:mybucket/myprefix\ntxt-media.example.com       IN      TXT     storj-access:totallyrandomstringofnonsens\n\u003C/code>\u003C/pre>\n\u003Cp>Create the DNS entries in Cloudflare with the values printed in the last three lines. Make sure you enable the proxy setting when entering the CNAME entry to enable Cloudflares CDN service.\u003C/p>\n\u003Cp>And that's it. All files you put in the bucket with the correct prefix are now available under your domain! :)\u003C/p>\n\u003Cp>If this blog post helped you, or you have some issues or thoughts on this, leave a comment via the comment box below or via webmention.\u003C/p>","blog/2022-12-storj-cloudflare-image-hosting","6d5a964d-328e-43d7-9189-40280b012074",["Date","2022-12-03T13:37:33.000Z"],[8],null,"Hosting Images with Storj and Cloudflare",true,"Learn how to setup affordable image hosting for your personal website with Storj.io and Cloudflare.","https://media.tiim.ch/d280fad4-632a-4b5a-b6b2-6a5c0026b61c.jpg","Image generated by Dall-E: travel postcards scattered on grass, top down view, photoreal",[15,16,17,18],"CDN","IndieWeb","Cloudflare","Storj","\u003Cp>[!WARNING] Update May 2024\nStorj has quietly removed their free plan and seems to hold all images on my website for ransom until I\npay for the premium plan. They have not notified my about this happening.\u003C/p>",[21,22,23,24],"cdn","cloudflare","indieweb","storj","article","blog",{"tag":22}],"uses":{"params":["slug"]}}]}
